pole = [["-","-","-","-","-","-","-","-"],
        ["-","*","*","*","*","*","*","-"],
        ["-","*","!","*","!","*","*","-"],
        ["-","!","*","*","!","*","*","-"],
        ["-","*","*","*","*","*","*","-"],
        ["-","!","!","*","!","*","*","-"],
        ["-","*","*","*","!","*","*","-"],
        ["-","*","*","*","*","*","*","-"],
        ["-","-","-","-","+","-","-","-"]]
a = 8
b = 4
pole[a][b] = "+"
for stroka in pole:
    for kletka in stroka:
        print(kletka,end ="")
    print()
d = input("куды пойдешь: направо, налево, вверх, вниз")
while d != "направо" or d != "налево" or d != "вверх" or d != "вниз":
    input("куды пойдешь: направо, налево, вверх, вниз")
if d == "направо":
    print()